# Assignment: Preparing Data for Analysis (Modified Titanic)

![](https://github.com/kaopanboonyuen/2110446_DataScience_2021s2/raw/main/%20files/hw.png)

In [111]:
#Import the libraries
import numpy as np
import pandas as pd

In [112]:
df = pd.read_csv('https://github.com/kaopanboonyuen/2110446_DataScience_2021s2/raw/main/datasets/hw/titanic_training_dataset_v2.csv')

In [113]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0.0,3.0,"Braund, Mr. Owen Harris",male,22.0,1.0,0,A/5 21171,7.2500,NaN,S
1,2,1.0,1.0,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1.0,0,PC 17599,71.2833,C85,C
2,3,1.0,3.0,"Heikkinen, Miss. Laina",female,26.0,0.0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1.0,1.0,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1.0,0,113803,53.1000,C123,S
4,5,0.0,3.0,"Allen, Mr. William Henry",male,35.0,0.0,0,373450,8.0500,NaN,S

In [114]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     865 non-null    float64
 2   Pclass       828 non-null    float64
 3   Name         866 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        858 non-null    float64
 7   Parch        891 non-null    int64
 8   Ticket       852 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     803 non-null    object
dtypes: float64(5), int64(2), object(5)
memory usage: 83.7+ KB

# 1) Load data & review the data

<font color='blue'>Q1) What is the shape of this dataset? (rows & columns)</font>

In [115]:
df.shape

(891, 12)

# 2) Drop unqualified variables

*   Drop variables with missing > 50%
*   Drop categorical variables with flat values > 70% (variables with the same value in the same column)

<font color='blue'>Q2) How many columns do we have left?</font>

In [116]:
half_count = len(df) / 2
sev_ty_per = len(df)*0.7

In [117]:
df = df.dropna(thresh = half_count,axis = 1)

In [118]:
df.shape

(891, 11)

In [119]:

for i in df.columns:
  if(df[i].value_counts().max() > sev_ty_per):
    df = df.drop(columns=[i])
df.shape

(891, 10)

# 3) Remove all rows with missing target (the variable "Survived")

<font color='blue'>Q3) How many rows do we have left?</font>

In [120]:
df = df[df["Survived"].isnull() == False]

In [121]:
df.shape

(865, 10)

# 4) Handle outliers 

For the variable “Fare”, replace outlier values with the boundary values


*   If value < (Q1 - 1.5IQR), relace with (Q1 - 1.5IQR)
*   If value > (Q3 + 1.5IQR), relace with (Q3 + 1.5IQR)

<font color='blue'>Q4) What is the mean of “Fare” after replacing the outliers (round 2 decimal points)?</font>

In [122]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Ticket,Fare,Embarked
0,1,0.0,3.0,"Braund, Mr. Owen Harris",male,22.0,1.0,A/5 21171,7.2500,S
1,2,1.0,1.0,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1.0,PC 17599,71.2833,C
2,3,1.0,3.0,"Heikkinen, Miss. Laina",female,26.0,0.0,STON/O2. 3101282,7.9250,S
3,4,1.0,1.0,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1.0,113803,53.1000,S
4,5,0.0,3.0,"Allen, Mr. William Henry",male,35.0,0.0,373450,8.0500,S
...,...,...,...,...,...,...,...,...,...,...
886,887,0.0,2.0,"Montvila, Rev. Juozas",male,27.0,0.0,211536,13.0000,S
887,888,1.0,1.0,"Graham, Miss. Margaret Edith",female,19.0,0.0,112053,30.0000,S
888,889,0.0,3.0,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1.0,W./C. 6607,23.4500,S
889,890,1.0,1.0,"Behr, Mr. Karl Howell",male,26.0,0.0,111369,30.0000,C
890,891,0.0,3.0,"Dooley, Mr. Patrick",male,32.0,0.0,370376,7.7500,Q

In [123]:
q75, q25 = np.percentile(df.Fare, [75 ,25])
iqr = q75 - q25

In [124]:
q25

7.8958

In [125]:
min = q25 - (iqr*1.5)
max = q75 + (iqr*1.5)

In [126]:
df["Fare"] = df["Fare"].where(df["Fare"] >=min,min)
df["Fare"] = df["Fare"].where(df["Fare"] <= max,max)

In [127]:
df["Fare"].mean()

24.038996878612718

# 5) Impute missing value



*   Show the number of missing values in each variable
*   Impute missing values with mean & mode
*   Show the number of missing values again after missing value imputation

<font color='blue'>Q5) Which variable has the largest number of missing values?</font>

In [128]:
for i in df.columns:
  print(i," = ",df[i].isnull().sum())

PassengerId  =  0
Survived  =  0
Pclass  =  63
Name  =  25
Sex  =  0
Age  =  172
SibSp  =  33
Ticket  =  39
Fare  =  0
Embarked  =  87

In [129]:
nan_column = ["Pclass", "Name","Age","SibSp","Ticket","Embarked"]

In [130]:
cate_cols = ['PassengerId',	'Survived',	'Pclass', 'Name',	'Sex', 'SibSp',	'Parch', 'Ticket','Embarked'] 
for col in nan_column:
  if(col in cate_cols):
    df[col] = df[col].fillna(df[col].mode().iloc[0])
  else: df[col] = df[col].fillna(df[col].mean())

In [131]:
for i in df.columns:
  print(i," = ",df[i].isnull().sum())

PassengerId  =  0
Survived  =  0
Pclass  =  0
Name  =  0
Sex  =  0
Age  =  0
SibSp  =  0
Ticket  =  0
Fare  =  0
Embarked  =  0

# 6) Convert categorical to numeric values



*   Drop the variables “Name” & “Ticket”
*   For the variables “Sex” & “Embarked”, perform the dummy coding and drop the first level. Also, drop those original variables (“Sex” & “Embarked”)

<font color='blue'>Q6) How many columns do we have?</font>

In [132]:
df = df.drop(columns = {"Name","Ticket"},axis = 1)

In [133]:
df.shape

(865, 8)

In [135]:
df_dummy = pd.get_dummies(df[["Sex","Embarked"]],drop_first = True)

In [136]:
df_dummy.shape

(865, 3)

In [137]:
df = pd.concat([df,df_dummy],axis = 1)
df

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Fare,Embarked,Sex_male,Embarked_Q,Embarked_S
0,1,0.0,3.0,male,22.000000,1.0,7.2500,S,1,0,1
1,2,1.0,1.0,female,38.000000,1.0,65.6563,C,0,0,0
2,3,1.0,3.0,female,26.000000,0.0,7.9250,S,0,0,1
3,4,1.0,1.0,female,35.000000,1.0,53.1000,S,0,0,1
4,5,0.0,3.0,male,35.000000,0.0,8.0500,S,1,0,1
...,...,...,...,...,...,...,...,...,...,...,...
886,887,0.0,2.0,male,27.000000,0.0,13.0000,S,1,0,1
887,888,1.0,1.0,female,19.000000,0.0,30.0000,S,0,0,1
888,889,0.0,3.0,female,29.892266,1.0,23.4500,S,0,0,1
889,890,1.0,1.0,male,26.000000,0.0,30.0000,C,1,0,0
890,891,0.0,3.0,male,32.000000,0.0,7.7500,Q,1,1,0

In [138]:
df = df.drop(["Sex","Embarked"],axis = 1)

In [139]:
df

,PassengerId,Survived,Pclass,Age,SibSp,Fare,Sex_male,Embarked_Q,Embarked_S
0,1,0.0,3.0,22.000000,1.0,7.2500,1,0,1
1,2,1.0,1.0,38.000000,1.0,65.6563,0,0,0
2,3,1.0,3.0,26.000000,0.0,7.9250,0,0,1
3,4,1.0,1.0,35.000000,1.0,53.1000,0,0,1
4,5,0.0,3.0,35.000000,0.0,8.0500,1,0,1
...,...,...,...,...,...,...,...,...,...
886,887,0.0,2.0,27.000000,0.0,13.0000,1,0,1
887,888,1.0,1.0,19.000000,0.0,30.0000,0,0,1
888,889,0.0,3.0,29.892266,1.0,23.4500,0,0,1
889,890,1.0,1.0,26.000000,0.0,30.0000,1,0,0
890,891,0.0,3.0,32.000000,0.0,7.7500,1,1,0

# 7) Partition data



*   Split train/test split with stratification using 70%:30% and random seed with 12345
*   Show a proportion between survived (1) and died (0) in all data sets (total data, train, test)

<font color='blue'>Q7) What is a proportion between survived (1) and died (0) in the training data?</font>

In [140]:
from sklearn.model_selection import train_test_split

In [141]:
X = df
y=df["Survived"]

In [142]:
X_train, X_test, y_train, y_test = train_test_split(X, y, stratify=y, test_size=0.3, random_state=12345)

In [143]:
survived_total = (df["Survived"] == 1).sum()
print("Total_data survived = ",survived_total/df.shape[0])
dead_total = (df["Survived"] == 0).sum()
print("Total_data survived = ",dead_total/df.shape[0])

Total_data survived =  0.3838150289017341
Total_data survived =  0.6161849710982659

In [144]:
survived_train = (y_train == 1).sum()
print("Train_data survived = ",survived_train/y_train.shape[0])
dead_train = (y_train == 0).sum()
print("Train_data survived = ",dead_train/y_train.shape[0])

Train_data survived =  0.3834710743801653
Train_data survived =  0.6165289256198347

In [145]:
survived_test = (y_test == 1).sum()
print("Test_data survived = ",survived_test/y_test.shape[0])
dead_test = (y_test == 0).sum()
print("Test_data survived = ",dead_test/y_test.shape[0])

Test_data survived =  0.38461538461538464
Test_data survived =  0.6153846153846154

In [146]:
print("Row in training set = ", X_train.shape[0])
print("Row in teat set = ", X_test.shape[0])

Row in training set =  605
Row in teat set =  260